using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace DudelkaBot.resources
{
    public static class Answers
    {
        public static List<string> level200 = new List<string>()
        {
            "Господи Иссуси, Матерб Божья, ЧТО ТЫ ТАКОЕ?",
            "Сексуалопитек.",
            "Радужный мишка",
            "Вы идол сексуальности",
            "Вы ослепли от такого уровня сексуальности. Ооох.",
            "Вентилятор",
            "Я узнаю его (её) из тысячи!",
            "Ты можешь видеть курсор, ты видишь всё что не зримо другим. А они, они теперь каждый день по расписанию бегают за тобой и насыщаются твоей сексуальностью.",
            "Да ты САМЫЙ сексуальный СЕНПАЙ нашего ГЕЙСКОГО общества. Твой ДВУРУЧНЫЙ МЕЧ, о боги ТЫ ИДЕАЛЬНЫЙ, ооооооо дааааа. Ты наполнен сексуальностью!",
            "Ваш Сексиметр достиг невероятных высот. Поздравляем!"
        };

        public static List<string> level190 = new List<string>()
        {
            "Вы на пике сексуальности",
            "Мои сосочки высоко высоко, соприкасаются с твоими.",
            "Хагрид",
            "Он(а) о что надо!",
            "Был вечер. Шёл дождь. Ты сидишь на скамейке по тусклым фонарём. Ты знаешь, что тебе больше не спрятаться. Теперь они всегда будут с тобой. Ибо теперь ты сексуален, а это чувствуется даже из космоса!",
            "Твой наполированный меч режет мне глаза, продолжаааай, ещё чуть чуть!",
            "Может быть остановишься?)"
        };

        public static List<string> level180 = new List<string>()
        {
            "Вы так же сексуальны как и складочки Джека",
            "Неужели, ты смог достигнуть такой сексуальности?",
            "О боже!!!",
            "Города подняты на уши все ищут тебя, все хотят тебя, ведь ты скоро станешь самым сексуальным человеком на планете, а может и во вселенной.",
            "Мечь возрос до 49,5 поздравляю ЭТО МАКСИМУМ Ты наполняешься сексуальностью!",
            "Ваша девушка не может поверить, в твой Сексиметр."
        };

        public static List<string> level170 = new List<string>()
        {
            "Закрывайте двери и окна, потому что толпа женщин и мужчин, особенно мужчин, уже ломится к вам в дом",
            "Ой я покраснел от него(неё)",
            "Тебя не отпускали три дня и три ночи, ты утомлён. Но ты смог сбежать. Тебе снова помогла твоя сексуальность, ты соблазном ушёл от охраны.",
            "Сенпай ты или нет, ты должен отрастить 16 складок и смотреть каждые стримы Артура/Даши",
            "Вы впечатлили Промпто",
            "Ктулха погладил тебя щупальцем. Уровень сексуальности изменился."
        };

        public static List<string> level160 = new List<string>()
        {
            "Вы так же сексуальны как и складочки Джека",
            "Неужели, ты смог достигнуть такой сексуальности?",
            "О боже!!!",
            "Города подняты на уши все ищут тебя, все хотят тебя, ведь ты скоро станешь самым сексуальным человеком на планете, а может и во вселенной.",
            "Мечь возрос до 49,5 поздравляю ЭТО МАКСИМУМ Ты наполняешься сексуальностью!",
            "Ваша девушка не может поверить, в твой Сексиметр",
            "Ктулха погладил тебя щупальцем. Уровень сексуальности изменился."
        };

        public static List<string> level150 = new List<string>()
        {
            "Семпай! Ты пришёл!",
            "Вертуфайзен",
            "Артур точно приходил к вам ночью",
            "Вроде за дверью тихо, ты приоткрыл дверь и это было ошибкой. Они поймали тебя. Что они сделают с таким сексуальным человеком?",
            "В чате тебя стали называть Сенпаем, ты любишь махать своим мечём",
            "Неприкасаемая Тося позволила вам погладить себя.",
            "Тёмная материя по имени Тося потёрлась о твою ногу, а потом укусила."
        };

        public static List<string> level140 = new List<string>()
        {
            "Ваша сексуальность пересекает все границы",
            "Семпай?",
            "Бро.",
            "Ты посмотрел на себя в зеркало, господи ты так прекрасен, что тебе пришлось разбить его иначе ты бы накинулся сам на себя",
            "10 складка есть, а если найду?",
            "Вы покорили сердца модеров.",
            "Ты слышишь божественный ту'ум Даши и наполняешься сексуальностью."
        };

        public static List<string> level130 = new List<string>()
        {
            "Кто это у нас тут? Трогает нечто А всё понятно.",
            "Какой(ая) он(а) всё таки...",
            "Запасы продовольствия кончаются, но ты пошёл на хитрость, ты поёшь песни нежным голосом, а так как он теперь сексуальный, толпа готова на всё ради тебя",
            "В чате тебя перестали игнорить, а тем временем твой меч вырос до 17см, ВОТ ЭТО РЫВОК",
            "Дуделка передает привет.",
            "Тебя зафлипендил Гарри и отсыпал волшебных бобов."
        };

        public static List<string> level120 = new List<string>()
        {
            "Вам начинает казаться(нет), что вас все хотят",
            "Могу ли я называть тебя семпай?",
            "Семпай не туда!",
            "Подписчики кое-как сдерживаются в выражении своей любви к вам.",
            "Кто-то тихо постучал в дверь этот милый женский голос прошептал, выйди ну на минутку, мы без ума от тебя, мы не причиним тебе вреда, только удовольствие",
            "Смотри! На 100 раз твоего доната Артур/Даша прочитали твой никнейм.",
            "Вы слышите послание из космоса: 'Твоя цель почти достигнута'",
            "ХагрИд приглашает тебя на чай."
        };

        public static List<string> level110 = new List<string>()
        {
            "Ваша сексуальность на кончиках пальцев",
            "Знаешь, ночь была прекрасна.",
            "Мажем помадой",
            "Ты потрогал лоб и понял, у тебя выросла вмятина и она, она, о боже какая же она сексуальная",
            "О боги! Откуда? Как? 7 складка, уиии смотрим за твоей эволюцией дальше.",
            "На вас обратил внимание 'Сексуальный король'",
            "Худжна села тебе на плечо и принесла немного сексуальности."
        };

        public static List<string> level100 = new List<string>()
        {
            "Сексуал.",
            "Что это такое большое у тебя в штанах?",
            "Семпай не туда",
            "Ооо дааа...",
            "Вас хотят !",
            "Они выломали доски и ворвались, ты заперся в ванной, но за дверью слышны крики: 'Иди к нам, мы тебя хотим!'",
            "Уры, 4-е складки 5-ти сантиметровый меч не делают тебе очень сексуальным, но старушки смотрият только на тебя. Старики нервно курят в сторонке.",
            "Ох, Семпай! Не туда!",
            "Артур пришёл к тебе ночью и поправил одеялко.",
            "Соски пробивают потолок и беспокоят соседей."
        };

        public static List<string> level90 = new List<string>()
        {
            "От вашей сексуальности у людей начинает кружиться голова",
            "У меня почти встал.",
            "Иди обниму...)",
            "Вы нас возбуждаете ...",
            "Теперь ты боишься показываться им на глаза, потому что знаешь что теперь и ты хочешь одаривать всех сексуальностью и боишься не сдержаться",
            "Смотри твой меч увеличился на пару сантиметров, а 4 складка вот-вот появится. Дела налаживаются",
            "Братва Артура, обратила на вас внимание.",
            "Ты съел конфету и наполнился сексуальностью до краёв.",
            "Люди на улицах узнают вашу сексуальность, она очень популярна."
        };

        public static List<string> level80 = new List<string>()
        {
            "Что это у тебя в штанах?",
            "Секси",
            "Первый прорвался. Он пролез через баррикады ночью и пытался найти вмятину на твоём лбу, ведь вмятина это одна из причин сексуальности",
            "Старушка заметила тебя на улице, и увидела в тебе сексуальную натуру, но мимо прошёл старик и старушка зыбыла о тебе, посмотрев тебе вслед презрительно. Старайся, тебя замечают и это прогресс",
            "Трисс, приняла вас в свои объятия",
            "Ты отвоевал сексуальность у другого чатовца, варвар! Бурдюк есть, а если найду?",
            "Сексуальность вырывается из под контроля и начинает жить своей жизнью."
        };

        public static List<string> level70 = new List<string>()
        {
            "Вам начинает становиться жарко от растущей сексуальности",
            "Ты уже близок к настоящей сексуальности.",
            "...",
            "Мужчины подмигивают и шлют вам поцелуйки",
            "Толпы увеличиваются, скоро тебе не спастись, и твоя сексуальность раскинет руки на весь мир",
            "Ты растёшь но не достаточно, три складки и что-то похожее на меч не делают тебя сексуальным. Старайся больше и лучше",
            "Золтан, считает вас крутым.",
            "Ты не подумОл и не сохранился, поэтому уровень сексуальности изменился.",
            "Люди начинают замечать вашу сексуальность."
        };

        public static List<string> level60 = new List<string>()
        {
            "Или будешь дочыком",
            "Вы семпай",
            "Я очень рад тому, что ты здесь.",
            "Посзравляшки :)",
            "Все хотят быть как ты, они думают что если прикоснуться то ты передашь им сексуальность, но мы то знаем в чём дело )",
            "Ты до сих пор не можешь привыкнуть к чему то острому в штанах, но тем временем у тебя появилась третья складка, она наполняет тебя сексуальностью.",
            "Ваш 'Сексиметр' удивляет чат.",
            "Беги в шкаф, воин! Дуделка уже в здании и ищет тебя!",
            "Соски буквально выглядывают из-за футболки."
        };

        public static List<string> level50 = new List<string>()
        {
            "Не... Будешь дочуркой",
            "Ваши сосочки начинают набухать и к вам в дверь стучится толпа мужчин",
            "Мои сосочки затвердели.",
            "Я а ж воспылал(а)",
            "Каждый оглядывается на вас на улице",
            "Вот и время пришло, ты начинаешь готовится к лучшему, заколачиваешь окна и двери выстраиваешь баррикады, а где-то вдалеке уже слышен гул тех кто хочет тебя",
            "Ууух, что то острое и блестящее появилось у тебя в штанах, ЧТО ЭТО?",
            "Вы заслужили уважение чата.",
            "Тебя нежно гладит Найтбот банхаммером по голове.",
            "Ночами стук соседей мешает вам заснуть."
        };

        public static List<string> level40 = new List<string>()
        {
            "Будешь сыном",
            "Мужчины шлют вам воздушные поцелуи",
            "О - ля -ля.",
            "А он (она) хорош (а)",
            "Каждый день твои волосы встают дыбом, ибо ты слышишь о чём говорят вокруг тебя, а они говорят, как ты хорош собой",
            "На самом деле это прикол, не нужно растить себе складок ты и так сексуальный (НЕТ)",
            "Бэтмен чувствует связь с вами.",
            "Тося бежала, хвостиком махнула и... смахнула твою сексуальность на пол.",
            "Противоположный пол оборачивается, замечая вашу сексуальность."
        };

        public static List<string> level30 = new List<string>()
        {
            "Добро пожаловать в семью",
            "Сексуальность в вашей крови",
            "Нужно проверить тебя в действии.",
            "Топчик",
            "Любовь просто хлещет во все стороны от него (неё)",
            "На вас обращают внимание",
            "Ты начинаешь готовится к сексуалпокалипсу, заготавливаешь припасы продовольствия, ищешь материалы для баррикад",
            "Смотри! ты научился говорить 'Красаульчик' правильно, но этого не достаточно",
            "Ты будешь дверью, а я тебя открою.",
            "Под злобный смех Даши уровень твоей сексуальности изменился и ты идёшь драить палубу.",
            "Ваша квартира средоточие сексуальности и начинает привлекать людей."
        };

        public static List<string> level20 = new List<string>()
        {
            "Парниша.",
            "Ну шош поделать",
            "От вас пахнет сексуальностью",
            "Кажется, я намок.",
            "Топчик не топчик",
            "Он мне нравится)",
            "Твои соски набухают и к тебе тянутся люди, чтобы потрогать тебя))",
            "Вау!!! смотри первая сексуальная складка, ты растёшь",
            "Вы заслужили внимание чата.",
            "Ты сброшен в подвал к модераторам, чтоб они оценили твою сексуальность и вот твой результат!",
            "Ваша сексуальность отображается бугорками на футболке."
        };

        public static List<string> level10 = new List<string>()
        {
            "'Свой' человек.",
            "Так себе, вообще",
            "Ну лан посиди",
            "Сексуалопитек",
            "Ну же, ты можешь больше.",
            "Полутопчик",
            "Он научился любить по гейски.",
            "Вы наполняетесь решимостью",
            "Ты постепенно начинаешь замечать, что окружающие люди как то очень откровенно смотрят на тебя, может они раздевают тебя взглядом?",
            "Твой уровень возрос, ты начинаешь наполнятся сексуальностью",
            "Продолжай в том же духе!",
            "Ты открываешь ящик с сексуальностью и тебе выпадает... химсвет! Но ты ты пытался.",
            "Вы чувствуете как сексуальность наполняет вас."
        };

        public static List<string> level0 = new List<string>()
        {
            "Натурал.",
            "Ти кто?",
            "Ну и чиво ты тут забыл?",
            "Не сексуал",
            "Есть к чему стремится.",
            "Не топчик",
            "Ты кто сексяшь?",
            "Welcome to the family, son/sister .",
            "Приветствую тебя избранный, скоро ты станешь один из нас ;)",
            "Ну ты вообще так себе!",
            "Приветствуем тебя.",
            "Фууу, ты что, натурал? Ктулхи съедят тебя! KappaPride DansGame",
            "Уровень сексуальности примерно на уровне моря."
        };
    }
}
